ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/Device/Include/HC32F448MATI.h
/*  Bit definition for CTC_CR2 register  */
#define CTC_CR2_OFSVAL_POS                             (0U)
#define CTC_CR2_OFSVAL                                 (0x000000FFUL)
#define CTC_CR2_RLDVAL_POS                             (16U)
#define CTC_CR2_RLDVAL                                 (0xFFFF0000UL)

/*  Bit definition for CTC_STR register  */
#define CTC_STR_TRIMOK_POS                             (0U)
#define CTC_STR_TRIMOK                                 (0x00000001UL)
#define CTC_STR_TRMOVF_POS                             (1U)
#define CTC_STR_TRMOVF                                 (0x00000002UL)
#define CTC_STR_TRMUDF_POS                             (2U)
#define CTC_STR_TRMUDF                                 (0x00000004UL)
#define CTC_STR_CTCBSY_POS                             (3U)
#define CTC_STR_CTCBSY                                 (0x00000008UL)

/*  Bit definition for CTC_CNT register  */
#define CTC_CNT                                        (0xFFFFU)

/*******************************************************************************
                Bit definition for Peripheral DAC
*******************************************************************************/
/*  Bit definition for DAC_DADR1 register  */
#define DAC_DADR1_DR0_POS                              (0U)
#define DAC_DADR1_DR0                                  (0x0001U)
#define DAC_DADR1_DR1_POS                              (1U)
#define DAC_DADR1_DR1                                  (0x0002U)
#define DAC_DADR1_DR2_POS                              (2U)
#define DAC_DADR1_DR2                                  (0x0004U)
#define DAC_DADR1_DR3_POS                              (3U)
#define DAC_DADR1_DR3                                  (0x0008U)
#define DAC_DADR1_DL0R4_POS                            (4U)
#define DAC_DADR1_DL0R4                                (0x0010U)
#define DAC_DADR1_DL1R5_POS                            (5U)
#define DAC_DADR1_DL1R5                                (0x0020U)
#define DAC_DADR1_DL2R6_POS                            (6U)
#define DAC_DADR1_DL2R6                                (0x0040U)
#define DAC_DADR1_DL3R7_POS                            (7U)
#define DAC_DADR1_DL3R7                                (0x0080U)
#define DAC_DADR1_DL4R8_POS                            (8U)
#define DAC_DADR1_DL4R8                                (0x0100U)
#define DAC_DADR1_DL5R9_POS                            (9U)
#define DAC_DADR1_DL5R9                                (0x0200U)
#define DAC_DADR1_DL6R10_POS                           (10U)
#define DAC_DADR1_DL6R10                               (0x0400U)
#define DAC_DADR1_DL7R11_POS                           (11U)
#define DAC_DADR1_DL7R11                               (0x0800U)
#define DAC_DADR1_DL8_POS                              (12U)
#define DAC_DADR1_DL8                                  (0x1000U)
#define DAC_DADR1_DL9_POS                              (13U)
#define DAC_DADR1_DL9                                  (0x2000U)
#define DAC_DADR1_DL10_POS                             (14U)
#define DAC_DADR1_DL10                                 (0x4000U)
#define DAC_DADR1_DL11_POS                             (15U)
#define DAC_DADR1_DL11                                 (0x8000U)

/*  Bit definition for DAC_DADR2 register  */
#define DAC_DADR2_DR0_POS                              (0U)
#define DAC_DADR2_DR0                                  (0x0001U)
#define DAC_DADR2_DR1_POS                              (1U)
#define DAC_DADR2_DR1                                  (0x0002U)
#define DAC_DADR2_DR2_POS                              (2U)
#define DAC_DADR2_DR2                                  (0x0004U)
#define DAC_DADR2_DR3_POS                              (3U)
#define DAC_DADR2_DR3                                  (0x0008U)
#define DAC_DADR2_DL0R4_POS                            (4U)
#define DAC_DADR2_DL0R4                                (0x0010U)
#define DAC_DADR2_DL1R5_POS                            (5U)
#define DAC_DADR2_DL1R5                                (0x0020U)
#define DAC_DADR2_DL2R6_POS                            (6U)
#define DAC_DADR2_DL2R6                                (0x0040U)
#define DAC_DADR2_DL3R7_POS                            (7U)
#define DAC_DADR2_DL3R7                                (0x0080U)
#define DAC_DADR2_DL4R8_POS                            (8U)
#define DAC_DADR2_DL4R8                                (0x0100U)
#define DAC_DADR2_DL5R9_POS                            (9U)
#define DAC_DADR2_DL5R9                                (0x0200U)
#define DAC_DADR2_DL6R10_POS                           (10U)
#define DAC_DADR2_DL6R10                               (0x0400U)
#define DAC_DADR2_DL7R11_POS                           (11U)
#define DAC_DADR2_DL7R11                               (0x0800U)
#define DAC_DADR2_DL8_POS                              (12U)
#define DAC_DADR2_DL8                                  (0x1000U)
#define DAC_DADR2_DL9_POS                              (13U)
#define DAC_DADR2_DL9                                  (0x2000U)
#define DAC_DADR2_DL10_POS                             (14U)
#define DAC_DADR2_DL10                                 (0x4000U)
#define DAC_DADR2_DL11_POS                             (15U)
#define DAC_DADR2_DL11                                 (0x8000U)

/*  Bit definition for DAC_DACR register  */
#define DAC_DACR_DAE_POS                               (0U)
#define DAC_DACR_DAE                                   (0x0001U)
#define DAC_DACR_DA1E_POS                              (1U)
#define DAC_DACR_DA1E                                  (0x0002U)
#define DAC_DACR_DA2E_POS                              (2U)
#define DAC_DACR_DA2E                                  (0x0004U)
#define DAC_DACR_DPSEL_POS                             (8U)
#define DAC_DACR_DPSEL                                 (0x0100U)
#define DAC_DACR_DAAMP1_POS                            (9U)
#define DAC_DACR_DAAMP1                                (0x0200U)
#define DAC_DACR_DAAMP2_POS                            (10U)
#define DAC_DACR_DAAMP2                                (0x0400U)
#define DAC_DACR_EXTDSL1_POS                           (11U)
#define DAC_DACR_EXTDSL1                               (0x0800U)
#define DAC_DACR_EXTDSL2_POS                           (12U)
#define DAC_DACR_EXTDSL2                               (0x1000U)

/*  Bit definition for DAC_DAADPCR register  */
#define DAC_DAADPCR_ADCSL1_POS                         (0U)
#define DAC_DAADPCR_ADCSL1                             (0x0001U)
#define DAC_DAADPCR_ADCSL2_POS                         (1U)
#define DAC_DAADPCR_ADCSL2                             (0x0002U)
#define DAC_DAADPCR_ADCSL3_POS                         (2U)
#define DAC_DAADPCR_ADCSL3                             (0x0004U)
#define DAC_DAADPCR_DA1SF_POS                          (8U)
#define DAC_DAADPCR_DA1SF                              (0x0100U)
#define DAC_DAADPCR_DA2SF_POS                          (9U)
#define DAC_DAADPCR_DA2SF                              (0x0200U)
#define DAC_DAADPCR_ADPEN_POS                          (15U)
#define DAC_DAADPCR_ADPEN                              (0x8000U)

/*  Bit definition for DAC_DAOCR register  */
#define DAC_DAOCR_DAODIS1_POS                          (14U)
#define DAC_DAOCR_DAODIS1                              (0x4000U)
#define DAC_DAOCR_DAODIS2_POS                          (15U)
#define DAC_DAOCR_DAODIS2                              (0x8000U)

